import sys
from time import sleep 
import time
import random

def song():
    words = [("0", 3),
             ("В этом году я вёд себя плохо", 0.05),
             ("Не слушался, так себе кушал", 0.05),
             ("Дедушка, ты будешь в ужасе", 0.05),
             ("Как в прошлом году, даже хуже", 0.05),
             ("Говорил слова нехорошие", 0.05),
             ("А те, что дал — все нарушил", 0.05),
             ("Ноль выводов из ошибок прошлого", 0.05),
             ("Только выводок новых грешков ещё взял на душу", 0.05),
             ("Хулиганил, дразнился, дрался", 0.05),
             ("Напивался, буянил — по полной жёг", 0.05),
             ("Каким был, таким и остался", 0.05),
             ("По-другому не смог", 0.05),
             ("Пожалуйста, положи для меня, меня нового, в свой мешок", 0.05),
             ("А я залезу на табуретку и прочту тебе свой стишок", 0.05),
             ("Я всё исправлю, починю и налажу", 0.05),
             ("Если снег новогодний на прошлогодние грабли не ляжет", 0.05),
             ("Так что я не замечу до боли знакомых зубцов под подошвой", 0.05),
             ("Если следующий год, как всегда, снова вдруг не окажется прошлым", 0.05),
             ("0", 1),
             ("Я хотел бы найти себя утром под ёлкой", 0.05),
             ("Сильным, хорошим и добрым", 0.05),
             ("В подарочной упаковке", 0.05),
             ("С локтями, лентой прижатыми к рёбрам", 0.05),
             ("С чистой совестью, разумом, сердцем и лёгкими", 0.05),
             ("Простым и глубоким", 0.05),
             ("Без желчных речей с подоплёкой", 0.05),
             ("Без глума над недалёкими", 0.05),
             ("Понявшим, принявшим, простившим и отпустившим", 0.05),
             ("В чулке у камина — новая карма", 0.05),
             ("Харе Рама, Ом, Харе Кришна", 0.05),
             ("Красношубый Всевышний", 0.05),
             ("Пролез бы в трубу и под ёлку меня положил", 0.05),
             ("Классный был бы подарок", 0.05),
             ("Жаль, его я не заслужил", 0.05),
             ("Я всё исправлю, починю и налажу", 0.05),
             ("Если снег новогодний на прошлогодние грабли не ляжет", 0.05),
             ("Так что я не замечу до боли знакомых зубцов под подошвой", 0.05),
             ("Если следующий год, как всегда, снова вдруг не окажется прошлым", 0.05),
             ("Я всё исправлю, починю и налажу", 0.05),
             ("Если снег новогодний на прошлогодние грабли не ляжет", 0.05),
             ("Так что я не замечу до боли знакомых зубцов под подошвой", 0.05),
             ("Если следующий год, как всегда, снова вдруг не окажется прошлым...", 0.05),
             ("0", 60)
             ]

    delays = [0, 0.5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,]
    for i, (word, char_delay) in enumerate(words):
        if word == "0":
            glitch_loading("               ", char_delay)
        else:
            for char in word:
                print(char, end="")
                sys.stdout.flush()
                sleep(char_delay)
            time.sleep(delays[i])
        print("")

def glitch_loading(text="               ", cycles=60):
    chars = "█▓▒░■□#@%&*"
    
    for _ in range(cycles):
        rand = "".join(random.choice(chars) for _ in range(len(text)))
        print("\r" + rand, end="")
        sys.stdout.flush()
        sleep(0.1)

    print("\r" + text)


print("Noize MC -- Грабли")
song()
